tutorials/heatTransfer/heatSimpleFoam/ImpJet-NnA/constant/ImpingedWall/RASProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object RASProperties;
 version 2.0;
}

RASModel LaunderSharmaYap;

turbulence yes;
printCoeffs yes;
scalarFaceSourceImpingedWall
{
  active on;
  scalarNumericFaceFluxSourceCoeffs
  {
    faceSource yes;
    factor 1;
    fieldNames
      (
        epsilon
        k
      );
    interfacePatch oldInternalFaces;
    mapPressure yes;
    nSubCycles 1;
    noAdvection yes;
    phiName phi;
    relaxGradP 1;
    rhoName rho;
    subField yes;
    turbField yes;
    wallPatch ImpingedWall;
    wallSource no;
  }
  selectionMode all;
  type scalarNumericFaceFluxSource;
}

