tutorials/heatTransfer/heatSimpleFoam/ImpJet-NnA/constant/ImpingedWall/transportProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object transportProperties;
 version 2.0;
}

transportModel Newtonian;

Prt Prt [0 0 0 0 0 0 0] 1;

nu nu [0 2 -1 0 0 0 0] 0.00037037037037;

Pr Pr [0 0 0 0 0 0 0] 1;

