tutorials/heatTransfer/heatSimpleFoam/ImpJet-NnA/0/T
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class volScalarField;
 format ascii;
 object T;
 version 2.0;
}

dimensions [ 0 0 0 1 0 0 0 ];

internalField uniform 0;

boundaryField
{
  Ambient
  {
    type zeroGradient;
  }
  Entrainment
  {
    type zeroGradient;
  }
  ImpingedWall
  {
    type slip;
    value uniform 0;
  }
  oldInternalFaces
  {
    type zeroGradient;
  }
  Inlet
  {
    type cyclic;
  }
  Outlet
  {
    type cyclic;
  }
  ExtPipeWall
  {
    type fixedValue;
    value uniform 1e-12;
  }
  Wedge1
  {
    type wedge;
  }
  Wedge2
  {
    type wedge;
  }
  Symm
  {
    type symmetryPlane;
  }
  mappedInlet
  {
    type mapped;
    setAverage no;
    average 0;
    value uniform 0;
    interpolationScheme cell;
  }
}

