tutorials/heatTransfer/heatSimpleFoam/ImpJet-NnA/system/ImpingedWall/fvOptions
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object fvOptions;
 version 2.0;
}

scalarFaceSourceImpingedWall
{
  active yes;
  scalarNumericFaceFluxSourceCoeffs
  {
    faceSource yes;
    factor 1;
    fieldNames
      (
        T
      );
    interfacePatch oldInternalFaces;
    mapPressure yes;
    nSubCycles 1;
    noAdvection yes;
    phiName phi;
    relaxGradP 1;
    rhoName rho;
    subField yes;
    turbField no;
    wallPatch ImpingedWall;
    wallSource no;
  }
  selectionMode all;
  type scalarNumericFaceFluxSource;
}

vectorFaceSourceImpingedWall
{
  active on;
  selectionMode all;
  type vectorNumericFaceFluxSource;
  vectorNumericFaceFluxSourceCoeffs
  {
    faceSource yes;
    factor 1;
    fieldNames
      (
        U
      );
    interfacePatch oldInternalFaces;
    mapPressure yes;
    nSubCycles 1;
    noAdvection yes;
    phiName phi;
    relaxGradP 1;
    rhoName rho;
    subField yes;
    turbField no;
    wallPatch ImpingedWall;
    wallSource no;
  }
}

