tutorials/heatTransfer/heatSimpleFoam/ImpJet-NnA/system/fvOptions
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object fvOptions;
 version 2.0;
}

scalarFaceSourceImpingedWall
{
  active yes;
  scalarNumericFaceFluxSourceCoeffs
  {
    faceSource no;
    factor 1;
    fieldNames
      (
        T
      );
    interfacePatch oldInternalFaces;
    mapPressure yes;
    nSubCycles 1;
    noAdvection yes;
    phiName phi;
    relaxGradP 1;
    rhoName rho;
    subField no;
    turbField no;
    wallPatch ImpingedWall;
    wallSource yes;
  }
  selectionMode all;
  type scalarNumericFaceFluxSource;
}

vectorFaceSourceImpingedWall
{
  active yes;
  selectionMode all;
  type vectorNumericFaceFluxSource;
  vectorNumericFaceFluxSourceCoeffs
  {
    faceSource no;
    factor 1;
    fieldNames
      (
        U
      );
    interfacePatch oldInternalFaces;
    mapPressure yes;
    nSubCycles 1;
    noAdvection yes;
    phiName phi;
    relaxGradP 1;
    rhoName rho;
    subField no;
    turbField no;
    wallPatch ImpingedWall;
    wallSource yes;
  }
}

DrivingForce1
{
  active yes;
  cellSet pipeCells;
  duration 1000000000.0;
  selectionMode cellSet;
  timeStart -1;
  type vectorSemiImplicitSource;
  vectorSemiImplicitSourceCoeffs
  {
    injectionRateSuSp
    {
      U
        (
          (0 0 -1)
          0
        );
    }
    volumeMode specific;
  }
}

HeatSource1
{
  active on;
  cellSet pipeCells;
  duration 1000000000.0;
  scalarSemiImplicitSourceCoeffs
  {
    injectionRateSuSp
    {
      T
        (
          1
          0
        );
    }
    volumeMode specific;
  }
  selectionMode cellSet;
  timeStart -1;
  type scalarSemiImplicitSource;
}

